In [1]:
a = [1,2,3,4,5]
print(a)

[1, 2, 3, 4, 5]

In [12]:
a = [1,2,3,4,5,5]
b = sorted(a, reverse=True)

In [13]:
b[1]c

5

In [14]:
max(b)

5

In [16]:
c = [x for x in a if x!=max(a)]

In [17]:
c

[1, 2, 3, 4]

In [18]:
max(c)

4

In [19]:
import pandas as pd

In [23]:
# Creating a sample dataframe
data = {
    'Employee_ID': [1, 2, 3, 1, 2, 3, 4, 5, 6, 1, 5],
    'Employee_Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Alice', 'Emma'],
    'Region': ['North', 'South', 'East', 'North', 'South', 'East', 'West', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 250, 300, 180, 220, 400, 320, 280, 500, 220]}

In [24]:
data

{'Employee_ID': [1, 2, 3, 1, 2, 3, 4, 5, 6, 1, 5],
 'Employee_Name': ['Alice',
  'Bob',
  'Charlie',
  'Alice',
  'Bob',
  'Charlie',
  'David',
  'Emma',
  'Frank',
  'Alice',
  'Emma'],
 'Region': ['North',
  'South',
  'East',
  'North',
  'South',
  'East',
  'West',
  'North',
  'South',
  'North',
  'North'],
 'Sales': [200, 150, 250, 300, 180, 220, 400, 320, 280, 500, 220]}

In [25]:
df = pd.DataFrame(data)

In [26]:
df

    Employee_ID Employee_Name Region  Sales
0             1         Alice  North    200
1             2           Bob  South    150
2             3       Charlie   East    250
3             1         Alice  North    300
4             2           Bob  South    180
5             3       Charlie   East    220
6             4         David   West    400
7             5          Emma  North    320
8             6         Frank  South    280
9             1         Alice  North    500
10            5          Emma  North    220

In [28]:
df['Region'].sum

<bound method Series.sum of 0     North
1     South
2      East
3     North
4     South
5      East
6      West
7     North
8     South
9     North
10    North
Name: Region, dtype: object>

In [31]:
df.iloc[0:1]

   Employee_ID Employee_Name Region  Sales
0            1         Alice  North    200

In [32]:
df[df['Employee_Name']=='Alice']

   Employee_ID Employee_Name Region  Sales
0            1         Alice  North    200
3            1         Alice  North    300
9            1         Alice  North    500

In [34]:
df[df['Region']=='North'].sum()

Employee_ID                             13
Employee_Name      AliceAliceEmmaAliceEmma
Region           NorthNorthNorthNorthNorth
Sales                                 1540
dtype: object